docs/记录一次安装狗哥的emacs-rime输入法过程记录.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-03-17 一 16:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd30f843">1. 记录一次安装狗哥的emacs-rime输入法过程记录</a>
<ul>
<li><a href="#org436745b">1.1. 特别感谢</a></li>
<li><a href="#orgc73d5ed">1.2. 配置方案</a></li>
<li><a href="#org27c06a7">1.3. 安装方法</a>
<ul>
<li><a href="#org541036f">1.3.1. 先决条件</a></li>
<li><a href="#org263e4c8">1.3.2. 输入方案</a></li>
<li><a href="#org7876a87">1.3.3. 再在GNU Emacs上部署</a></li>
</ul>
</li>
<li><a href="#orge8ad041">1.4. 最后声明</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgd30f843" class="outline-2">
<h2 id="orgd30f843"><span class="section-number-2">1.</span> 记录一次安装狗哥的emacs-rime输入法过程记录</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org436745b" class="outline-3">
<h3 id="org436745b"><span class="section-number-3">1.1.</span> 特别感谢</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="https://github.com/rime">rime输入法作者: 佛振</a></li>

<li><a href="https://github.com/DogLooksGood/emacs-rime">狗哥的emacs-rime</a></li>

<li><a href="https://emacs-china.org/">Emacs China论坛及坛友</a></li>

<li><a href="https://github.com/rime/rime-double-pinyin">rime提供的自然码双拼输入方案</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc73d5ed" class="outline-3">
<h3 id="orgc73d5ed"><span class="section-number-3">1.2.</span> 配置方案</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">序号</th>
<th scope="col" class="org-left">配置方案</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">输入方案</td>
<td class="org-left">周老开发的自然码双拼</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">输入文字</td>
<td class="org-left">简体中文</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">输入法前端</td>
<td class="org-left">emacs-rime</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">输入法后端</td>
<td class="org-left">rime</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org27c06a7" class="outline-3">
<h3 id="org27c06a7"><span class="section-number-3">1.3.</span> 安装方法</h3>
<div class="outline-text-3" id="text-1-3">
<p>
安装困难的地方，主要唯一的是在于 <code>rime</code> 的部署，因为 <code>rime官方文档</code> 是用繁体字所写的，对于我自己来说，较难看懂
</p>
</div>
<div id="outline-container-org541036f" class="outline-4">
<h4 id="org541036f"><span class="section-number-4">1.3.1.</span> 先决条件</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">
<pre class="src src-sh"># 安装fcitx5全家桶
sudo pacman -S fcitx5-im fcitx5-chinese-addons fcitx5-rime fcitx5-material-color

# 同时在 ArchLinux 下编辑 /etc/environment 文件
# 添加 GTK_IM_MODULE=fcitx
# 添加 QT_IM_MODULE=fcitx
# 添加 XMODIFIERS=@im=fcitx
# 添加 SDL_IM_MODULE=fcitx
sudo vim /etc/environment    
</pre>
</div>
</div>
</div>
<div id="outline-container-org263e4c8" class="outline-4">
<h4 id="org263e4c8"><span class="section-number-4">1.3.2.</span> 输入方案</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
首先，先复制 <a href="https://github.com/rime/rime-double-pinyin/blob/master/double_pinyin.schema.yaml">rime提供的自然码双拼输入方案</a> 的所有文字到 <code>/usr/share/rime-data</code> 下
</p>

<div class="org-src-container">
<pre class="src src-sh">cd /usr/share/rime-data
# 因为是在 /usr/share 路径下
# 所以需要 sudo 权限创建 新文件(新文件名: double_pinyin.schema.yaml)  
sudo vim double_pinyin.schema.yaml

# 将 [rime提供的自然码双拼输入方案] 的文本内容，复制粘贴到这里
# 保存退出vim (:wq)
</pre>
</div>

<p>
在默认部署后，默认输入的文字是 <b>繁体字</b> 这是因为 <b>yaml配置文件导致的</b>
</p>

<p>
想要设置简体字，就进行 <a href="https://github.com/rime/rime-double-pinyin/issues/3#issuecomment-864338144">设置reset: 1的简体字配置项</a>
</p>
</div>
</div>
<div id="outline-container-org7876a87" class="outline-4">
<h4 id="org7876a87"><span class="section-number-4">1.3.3.</span> 再在GNU Emacs上部署</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
<code>输入法后端rime</code> 的问题我们解决了，我们还剩下 <code>输入法前端emacs-rime</code> 的事情
</p>

<p>
这是我当时的安装流程，现在不知道是否还是这样 (但当时我自己这样操作是可以 <b>成功部署</b> 的)
</p>

<p>
首先安装 <a href="https://github.com/DogLooksGood/emacs-rime/blob/master/INSTALLATION.org">emacs-rime</a>
</p>

<p>
再命令行安装librime
</p>

<div class="org-src-container">
<pre class="src src-sh"># 
# 本机依赖(via ArchLinux)
pacman -S librime  
</pre>
</div>

<p>
而且添加.el配置文件
</p>

<div class="org-src-container">
<pre class="src src-elisp">;; 安装rime包
;; M-x list-packages，然后C-s搜 "rime"，按 i 标记，按 x 执行      
(use-package rime
  :ensure t
  :defer nil
  :custom
  (default-input-method "rime"))
</pre>
</div>

<p>
然后再部署，执行必要的脚本，来使用 <code>rime提供的自然码双拼输入方案</code>
</p>

<div class="org-src-container">
<pre class="src src-nil"># 按下 "\" 键(反斜杠键)，来动态加载rime这个包
# 然后会提示要在自己的emacs配置文件处，创建rime文件夹。yes就是了
# 然后 M-x rime-open-configuration ，从而来打开 “部署rime的配置文件”
# 我个人的配置在 ~/.config/emacs/rime/default.custom.yaml 这里
# 最后使用任意编辑器，加上这里的配置，就可以使用这里的rime提供的自然码双拼输入方案
patch:
  schema_list:
    - schema: double_pinyin
  menu/page_size: 9  
</pre>
</div>

<p>
最后重新部署
</p>

<div class="org-src-container">
<pre class="src src-elisp">;; 打开GNU Emacs后，先执行重新部署函数(rime-deploy)
;; 接下来设置默认激活emacs-rime的输入法快捷键
;; 用 C+SPC 来切换由狗哥开发的Emacs-rime的激活输入法按键(默认是C-\，现在改成C-SPC)
;; 同时保证自己的fcitx5的切换键，不是C-SPC就可以了。(可以在 “KDE &gt; 输入法” 此处设置快捷键)
(global-set-key (kbd "C-SPC")         'toggle-input-method)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge8ad041" class="outline-3">
<h3 id="orge8ad041"><span class="section-number-3">1.4.</span> 最后声明</h3>
<div class="outline-text-3" id="text-1-4">
<p>
这是我个人在 <code>2024年04月25日</code> 写的，当时还是在用着 <code>Emacs 29.3</code> 呢，现在来说个人不知道这样做还有没有效果&#x2026;&#x2026;&#x2026;&#x2026;
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-03-17 一 16:21</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
